In [4]:
df = pd.DataFrame(np.array([[3,4,5],
                     [1,2,3],
                     [7,8,9]]), 
            columns=['a', 'b','c'],
            index=[1,2,3])
df

   a  b  c
1  3  4  5
2  1  2  3
3  7  8  9

In [47]:
df.apply?

# apply() 결과값은 시리즈 또는 데이터프레임 (벡터 또는 행렬)
- raw : row나 칼럼을 시리즈 또는 ndarray 배열 중 어느 걸로 함수에 집어넣을 지 정해준다. <데이터 유형만 다르게 해주는 arg>
* if raw == False : 시리즈 형태로 함수에 집어넣는다. 
* if raw == True : ndarray()배열 형태로 함수에 집어넣는다. 

\n
# result_type()은 칼럼에 대해서만 적용가능 axis=1
- result_type : <결과값을 어떻게 표현할지에 대한 arg>
* axis=1, 칼럼에 대해서만 동작
- expand : 결과값이 행벡터면, 데이터프레임 형태로 결과값 반환. 결과값이 스칼라면 시리즈 형태로 반환. 결과값이 열벡터인 경우 시리즈로 반환
- reduce : 가능하다면 시리즈 형태로 결과값 반환. (아니면 데이터프레임.) expand와 정반대
- broadcast : 결과값이 벡터든, 스칼라든 뭐든 무조건 데이터프레임 형태로 결과값 반환 (본래 데이터프레임 형식 그대로 유지)
- None 이면 : 함수가 내놓는 결과값이 행벡터면 시리즈 형태 반환 / 열벡터 여러 개 반환하면 데이터프레임 반환, 열벡터 1개면 그대로 시리즈반환

- 열벡터 = 시리즈 
- 행벡터 = list-like
-

In [107]:
df.iloc[[0, 1]].apply(list, axis=1, result_type=None)

1    [3, 4, 5]
2    [1, 2, 3]
dtype: object

In [ ]:
# 시리즈 : 열벡터

In [75]:
df.iloc[[0], 0]

1    3
Name: a, dtype: int64

In [80]:
df

   a  b  c
1  3  4  5
2  1  2  3
3  7  8  9

In [90]:
df.apply(sum, axis=1, result_type='expand')

1    12
2     6
3    24
dtype: int64

In [96]:
df.min() #데이터프레임은 칼럼 중심이다. <-- 벡터와 행렬을 생각해보면 왜 이렇게 되는지 이해가 된다.

a    1
b    2
c    3
dtype: int64

In [109]:
df.std()

a    3.05505
b    3.05505
c    3.05505
dtype: float64

In [110]:
# df.dropna() : null값이 하나라도 있는 row(데이터레코드) 제거 
df.dropna()

   a  b  c
1  3  4  5
2  1  2  3
3  7  8  9

In [111]:
df['d'] = [None, None, 1]

In [122]:
# df.fillna('value') : null값에 value를 채워넣어라
df.fillna(5.67)

   a  b  c     d
1  3  4  5  5.67
2  1  2  3  5.67
3  7  8  9  1.00

# make new columns

In [126]:
# df.assign()메서드로 칼럼 추가할 수 있다. 
df.assign?

In [128]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]},index=['Portland', 'Berkeley'])
df

          temp_c
Portland    17.0
Berkeley    25.0

In [141]:
#assign()메서드는 이런 식이다. df.assign(칼럼이름(''없음)=[칼럼 값])
#assign()으로 추가해준 후 변수 재지정해줘야 된다. 
df.assign(안녕=[1,2])
df = df.assign(temp_f=lambda x : x.temp_c*9/5+32)
df

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

In [150]:
df = df.assign(temp_x=df['temp_c']*8/5+32)# 이런 식으로 기존 칼럼 값에 바로 연산해줄 수도 있다.

In [153]:
# 한번에 여러 칼럼 동시에 만들 수도 있다. 
# 하나의 assign메서드 안에서 정의된 칼럼 다시 이용해서 또 다른 칼럼 또 만들 수 있다. 
df.assign(temp_y=lambda x : x['temp_c']*9/5+32, 
         temp_s=lambda x:(x['temp_y']+3234.3)*5/9) #temp_y정의하고, 그걸 다시 받아서 temp_s 생성함.

          temp_c  temp_f  temp_x  temp_y       temp_s
Portland    17.0    62.6    59.2    62.6  1831.611111
Berkeley    25.0    77.0    72.0    77.0  1839.611111

In [155]:
df = df.assign(temp_y=lambda x : x['temp_c']*9/3+45,
         temp_xx=[1,2]) #또 굳이 변수들끼리 계산 연쇄 안 해도, 여러 칼럼 동시에 만들 수 있다. 
# 칼럼 이름에는 '' 붙지 않는다.

In [156]:
df

          temp_c  temp_f  temp_x  temp_y  temp_xx
Portland    17.0    62.6    59.2    96.0        1
Berkeley    25.0    77.0    72.0   120.0        2

In [159]:
# 좀 더 고전적인 방식 df[]
df['volume'] = df['temp_c']*3+32/3 #이거는 따로 변수 지정 새로 안 해줘도 된다는 장점 있다.

In [158]:
df

          temp_c  temp_f  temp_x  temp_y  temp_xx     volume
Portland    17.0    62.6    59.2    96.0        1  61.666667
Berkeley    25.0    77.0    72.0   120.0        2  85.666667

# pd.qcut : 칼럼을 n개 바구니로 나누기 
# 나는 바구니 갯수 n을 지정해 줄 수 있다. 각 바구니에는 같은 수 표본이 들어간다.
- 칼럼을 내가 입력한 분위수 기준으로 쪼개서 여러 개로 만들기 
\n

- x : 쪼갤 칼럼
- q : 정수, 여러 실수로 구성된 리스트나 튜플 <바구니 나누는 기준을 직접 정해주거나[0,.25,.5,.75,1.0] 4이렇게 나눌 바구니 수 정해줄 수 있다.>
- labels : 바구니 이름 리스트 또는 False // 각 바구니에 붙일 이름 정한다. / False이면 기본형인 정수로 붙는다. 
- retbins : true이면 최종 결과값에 바구니(구간)도 함께 출력해준다. 기본은 false
- precision : 바구니 label 기본은 구간으로 나온다. 이 구간 나타내는 실수를 소수 몇 째 자리 까지 출력할건가? int=3 이면 소수 셋째 자리.
특정 라벨이 이미 붙어 있는 경우는 precision이 아무 효과도 갖지 못한다.
- duplicates : q갯수 만큼 바구니 만들건데, 각 바구니는 구간이 정해져 있다. 예[1.9 ~ 3.0]. 이때 바구니 구간 edge 중에 중복이 있으면 value error 발생한다. 만약 duplicates='drop'이면, 중복 edge 제거한다.

In [225]:
df = pd.DataFrame([[1,2,3],
             [1,2,3],
             [1,2,3],
             [3,4,5],
             [4,5,6],
             [2,3,4]])
df

   0  1  2
0  1  2  3
1  1  2  3
2  1  2  3
3  3  4  5
4  4  5  6
5  2  3  4

In [252]:
pd.qcut(df[0],q=3) #3개 바구니로 구간잡아 나눌 건데, edge 중복 구간이 있다. 
#value_error 발생

ValueError: Bin edges must be unique: array([1.        , 1.        , 2.33333333, 4.        ]).
You can drop duplicate edges by setting the 'duplicates' kwarg

In [254]:
pd.qcut(df[0], q=3, duplicates='drop') #3개로 나누라고 했지만, 중복 구간 제거하면서 2개 바구니로 나뉘었다.

0    (0.999, 2.333]
1    (0.999, 2.333]
2    (0.999, 2.333]
3      (2.333, 4.0]
4      (2.333, 4.0]
5    (0.999, 2.333]
Name: 0, dtype: category
Categories (2, interval[float64]): [(0.999, 2.333] < (2.333, 4.0]]

In [179]:
pd.qcut(range(5), 3, labels=['good','medium','bad'])

['good', 'good', 'medium', 'bad', 'bad']
Categories (3, object): ['good' < 'medium' < 'bad']

In [180]:
pd.qcut(range(5), 4, labels=False)

array([0, 0, 1, 2, 3])

In [183]:

import numpy as np

import pandas as pd

from pandas import DataFrame



np.random.seed(123)

df = DataFrame({'col_1': np.random.randint(20, size=20), 

                      'col_2': np.random.randn(20)})


df

    col_1     col_2
0      13  1.730024
1       2  1.232650
2       2 -0.823598
3       6 -0.118201
4      17 -0.576103
5      19  1.695731
6      10 -0.074394
7       1 -1.900637
8       0 -0.777655
9      17  1.313462
10     15  1.804458
11      9 -0.965550
12      0 -1.316480
13     14 -0.625785
14      0 -0.326946
15     15 -0.308209
16     19  0.827117
17     14  1.070781
18      4 -3.055577
19      0  1.005932

In [188]:
pd.qcut(df.col_1, 5, labels=False)

0     2
1     1
2     1
3     2
4     4
5     4
6     2
7     1
8     0
9     4
10    3
11    2
12    0
13    3
14    0
15    3
16    4
17    3
18    1
19    0
Name: col_1, dtype: int64

In [190]:
# 한 바구니에 표본 4개씩 들어간다. 바구니 별 이름은 4,3,2,1 이렇게 붙는다. 
pd.qcut(df.col_1, 4, labels=np.arange(4,0,-1))

0     2
1     3
2     3
3     3
4     1
5     1
6     2
7     4
8     4
9     1
10    2
11    3
12    4
13    2
14    4
15    2
16    1
17    2
18    3
19    4
Name: col_1, dtype: category
Categories (4, int64): [4 < 3 < 2 < 1]

In [213]:
pd.qcut(df.col_1, 5,) #다섯 바구니로 나눴다. 각 바구니에 들은 갯수는 같다. 
df_qcut = pd.qcut(df.col_1, 5, labels=[3.2,3.3,3.4,1.1,1]) #각 다섯 바구니에 다섯개 이름 붙여줬다.

In [220]:
df_qcut

0     3.4
1     3.3
2     3.3
3     3.4
4     1.0
5     1.0
6     3.4
7     3.3
8     3.2
9     1.0
10    1.1
11    3.4
12    3.2
13    1.1
14    3.2
15    1.1
16    1.0
17    1.1
18    3.3
19    3.2
Name: col_1, dtype: category
Categories (5, float64): [3.2 < 3.3 < 3.4 < 1.1 < 1.0]

In [224]:
pd.qcut(df.col_1, q=[0,.25,.5,.75,1], labels=['d','a','x','z']) #4개 바구니 생성

0     x
1     a
2     a
3     a
4     z
5     z
6     x
7     d
8     d
9     z
10    x
11    a
12    d
13    x
14    d
15    x
16    z
17    x
18    a
19    d
Name: col_1, dtype: category
Categories (4, object): ['d' < 'a' < 'x' < 'z']

In [223]:
pd.qcut(df.col_1, q=4)

0        (9.5, 15.0]
1        (1.75, 9.5]
2        (1.75, 9.5]
3        (1.75, 9.5]
4       (15.0, 19.0]
5       (15.0, 19.0]
6        (9.5, 15.0]
7     (-0.001, 1.75]
8     (-0.001, 1.75]
9       (15.0, 19.0]
10       (9.5, 15.0]
11       (1.75, 9.5]
12    (-0.001, 1.75]
13       (9.5, 15.0]
14    (-0.001, 1.75]
15       (9.5, 15.0]
16      (15.0, 19.0]
17       (9.5, 15.0]
18       (1.75, 9.5]
19    (-0.001, 1.75]
Name: col_1, dtype: category
Categories (4, interval[float64]): [(-0.001, 1.75] < (1.75, 9.5] < (9.5, 15.0] < (15.0, 19.0]]

In [255]:
pd.qcut?

In [272]:
pd.qcut(df[0], q=3, duplicates='drop', retbins=True, labels=[1,2],precision=4 )

(0    1
 1    1
 2    1
 3    2
 4    2
 5    1
 Name: 0, dtype: category
 Categories (2, int64): [1 < 2],
 array([1.        , 2.33333333, 4.        ]))

# 벡터함수들 : 전체 칼럼 또는 선택된 칼럼에 대해 연산하고, 결과값들로 구성된 벡터 생성하거나, 단일 열벡터에 대해서는 시리즈 생성해준다.

In [277]:
df

   0  1  2
0  1  2  3
1  1  2  3
2  1  2  3
3  3  4  5
4  4  5  6
5  2  3  4

In [282]:
df.max(axis=1)
df.max(axis=0)
df[0].max()

4

In [286]:
df.min()
df.min(axis=1) #벡터다.

0    1
1    1
2    1
3    3
4    4
5    2
dtype: int64

In [294]:
df

   0  1  2
0  1  2  3
1  1  2  3
2  1  2  3
3  3  4  5
4  4  5  6
5  2  3  4

In [293]:
# df.clip() 내가 지정해준 최솟값, 최댓값 범위 안에서 df 값들을 '다듬는다'
# 최솟값보다 낮은 값은 최솟값으로 바꾸고, 최댓값보다 높은 값은 최댓값으로 바꾼다. 
df.clip(lower=2, upper=4)

   0  1  2
0  2  2  3
1  2  2  3
2  2  2  3
3  3  4  4
4  4  4  4
5  2  3  4

In [303]:
df = df.assign(dd=df[2]*3+5/2,
              aa=df['dd']+22/4+1,
              xx=df['aa']-1000)

In [306]:
df

   0  1  2    dd    aa     xx
0  1  2  3  11.5  18.0 -982.0
1  1  2  3  11.5  18.0 -982.0
2  1  2  3  11.5  18.0 -982.0
3  3  4  5  17.5  24.0 -976.0
4  4  5  6  20.5  27.0 -973.0
5  2  3  4  14.5  21.0 -979.0

In [309]:
# df.abs() value들을 모두 절댓값으로 바꿔준다. 
df.abs()

     0    1    2    dd    aa     xx
0  1.0  2.0  3.0  11.5  18.0  982.0
1  1.0  2.0  3.0  11.5  18.0  982.0
2  1.0  2.0  3.0  11.5  18.0  982.0
3  3.0  4.0  5.0  17.5  24.0  976.0
4  4.0  5.0  6.0  20.5  27.0  973.0
5  2.0  3.0  4.0  14.5  21.0  979.0

# Group data 데이터 그룹핑하기

In [348]:
df

   0  1  2    dd    aa     xx
0  1  2  3  11.5  18.0 -982.0
1  1  2  3  11.5  18.0 -982.0
2  1  2  3  11.5  18.0 -982.0
3  3  4  5  17.5  24.0 -976.0
4  4  5  6  20.5  27.0 -973.0
5  2  3  4  14.5  21.0 -979.0

- by : group 기준으로 삼을 것 입력. 컬럼 이름, 인덱스 이름, 특정 값, 특정 값들 전부 다 기준이 될 수 있다. 
- axis : group할 기준 축
- level : 내가 groupby 하려는 축이 계층적 인덱스 이면, 계층 내에서 level을 지정해줄 수 있다. 
- as_index : 결과물에서 group기준이 된 label들이 인덱스로 들어간다. (기본값이 true). 
- dropna : 기본값이 true. null값 있는 row나 칼럼은 삭제된다.

In [350]:
# groupby()
# 1 기준 칼럼안에 value 같은것 끼리 묶자. 2. 각 그룹별 데이터프레임 만든다. 3 각 데이터프레임 값들에 뒤에 따라붙는 메서드 적용한다. 


df.groupby(by='dd').mean()
df.groupby('xx').mean()

        0  1  2    dd    aa
xx
-982.0  1  2  3  11.5  18.0
-979.0  2  3  4  14.5  21.0
-976.0  3  4  5  17.5  24.0
-973.0  4  5  6  20.5  27.0

In [357]:
df.groupby(by='xx', axis=0).mean()

        0  1  2    dd    aa
xx
-982.0  1  2  3  11.5  18.0
-979.0  2  3  4  14.5  21.0
-976.0  3  4  5  17.5  24.0
-973.0  4  5  6  20.5  27.0

In [388]:
df = pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]],
            columns=[[1,1,2],
                    ['a','b','c']],
            index=pd.MultiIndex.from_tuples([[1,2],
                                            [3,3],
                                            [2,4]]))
df

     1     2
     a  b  c
1 2  1  2  3
3 3  4  5  6
2 4  7  8  9